
<HTML>

<button>click</button>
<?php
include"class.test.php";
// class _numbers extends Test{
	
	// var $arr = array(7,8,9,10);
	// function __construct(){
    // {
		// echo "Public Function: ".$this->showData()."<br/>";
		// echo "Protected Function: ".$this->showProtected()."<br/>";
		// //echo "Private Function: ".$this->myPrivateFunc()."<br/>";
	// }
// }
// $_test_class = new Test('bank','pat');
// $_test_class->showData();
//$_test_class->showPrivate();

//exam: 1
//จงเขียนฟังก์ชั่น หาตำแหน่งแรก(indexOf)  ของคำที่ส่งเข้าไป  ให้เวลาทำ  1 นาที  ( 1 คะแนน)
// ตัวอย่าง 
// string intput = "Hello world";
// string patten = "world";
//$first_digit;
function _example1(){
	$input = "HELLO WORLD";
	$pattern = "WORLD";
	
	$a = str_split($input);
	for($i = 0;$i <= count($a); $i ++){
		if($a[$i] == "W"){
			echo $i;
		}
		if($a[$i] == " "){
			unset($a[$i]);
		}
	}
		print_r($a);
}
//ข้อสอบสมัครงาน //2
//โปรแกรมมิ่งข้อที่ 1 ให้เขียนโปรแกรมตู้ ATM ครับ โดยกำหนดให้มีเงินอยู่ในตู้ 23,000 บาท แบ่งเป็น แบงค์พัน 10 ใบ แบงค์ 500 20 ใบ แบงค์ 100 30 ใบ (ถ้าจำไม่ผิดนะครับ ลืมไปแล้ว)
//โดยให้เขียนโปรแกรมเพื่อรับจำนวนเงินที่จะถอน จากนั้นโปรแกรมจะแสดงจำนวนแบงค์ที่ออกมา ซึ่งแบงค์พันจะออกก่อน แล้วก็แบงค์ 500 100 ตามลำดับ

function _example2($money){
	$balance = 23000;
	$change = 0;
	$b1000=10;
	$b500=20;
	$b100=30;
	$b1000= "";
	if($money > $balance ){
		echo "เงินไม่พอทอน";
	}
	else{
		$change = $balance - $money;
		$bank = floor($balance / $money);
		$bbalance = $balance-($bank*$money);
		if($money >= 1000){
			
		}
	}

}
//_example2(3000);
//}
//ex3:ภารกิจของคุณ
// รับ input เป็นตัวเลขจำนวนเต็ม a และ b จากนั้นให้ output ผลรวมของตัวเลขทั้ง 2 จำนวนออกทางจอภาพ

// ข้อมูลนำเข้า
// บรรทัดแรก จำนวนเต็ม a โดยที่ 0 <= a <= 109
// บรรทัดที่สอง จำนวนเต็ม b โดยที่ 0 <= b <= 109
function _example3($a,$b){
	if(($a >= 0 && $a <= 10000000000) && ($b >= 0 && $b <= 10000000000)){
		$output = $a + $b;
		echo $output;
	}
	else{
		echo 'error';
	}
}




// exam4=ในการเรียนวิชาคอมพิวเตอร์ ณ โรงเรียนแห่งหนึ่ง ใช้วิธีการเก็บคะแนนในรูปแบบของ
// คะแนนเก็บ 30 คะแนน
// คะแนนสอบกลางภาค 30 คะแนน
// คะแนนสอบปลายภาค 40 คะแนน
// รวมทั้งสิ้น 100 คะแนน หลังจากที่จบภาคการศึกษา ฝ่ายทะเบียนวัดผลของโรงเรียนต้องการให้อาจารย์ที่สอนวิชาคอมพิวเตอร์มาคีย์คะแนนลงในระบบคอมพิวเตอร์ เพื่อจะได้ทราบถึงเกรดที่นักเรียนแต่ละคนควรจะได้ โดยใช้โปรแกรมเข้าช่วย แต่เนื่องจากว่าทางงานทะเบียนวัดผลนี้ยังไม่มีโปรแกรมใช้ (อาจเป็นเพราะเหตุเกิดเมื่อนานมาแล้ว) อาจารย์ฝ่ายทะเบียนวัดผลจึงมาขอให้คุณช่วยเขียนโปรแกรมให้หน่อย

// โจทย์
// ให้นักเรียนเขียนโปรแกรมตัดเกรดเพื่อช่วยงานทะเบียนวัดผลของโรงเรียนแห่งนี้

// ข้อมูลนำเข้า
// บรรทัดแรก จำนวนเต็มบวก a (0 <= a <= 30) เป็นคะแนนเก็บของนักเรียน
// บรรทัดที่สอง จำนวนเต็มบวก b (0 <= b <= 30) เป็นคะแนนสอบกลางภาคของนักเรียน
// บรรทัดที่สาม จำนวนเต็มบวก c (0 <= c <= 40) เป็นคะแนนสอบปลายภาคของนักเรียน

// ข้อมูลส่งออก
// บรรทัดแรก เป็นอักขระใช้แทนเกรดของนักเรียน โดยที่ใช้อักขระตามเงื่อนไขดังต่อไปนี้
// A ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 80 - 100
// B+ ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 75 - 79
// B ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 70 - 74
// C+ ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 65 - 69
// C ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 60 - 64
// D+ ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 55 - 59
// D ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 50 - 54
// F ถ้าคะแนนรวมของนักเรียนอยู่ในช่วง 0 - 49
function _example4($a,$b,$c){
	if(($a >= 0 && $a <= 30) && ($b >= 0 && $b <= 30) && ($c >= 0 && $c <= 40)){
		$sum = $a + $b + $c;
		echo $sum;
		switch ($sum) {
			case ($sum >= 80 && $sum <= 100):
					echo "A";
				break;
			case ($sum >= 75 && $sum <= 79):
					echo "B+";
				break;
			case ($sum >= 70 && $sum <= 74):
					echo "B";
				break;
			case ($sum >= 65 && $sum <= 69):
					echo "C+";
				break;
			case ($sum >= 60 && $sum <= 64):
					echo "C";
				break;
			case ($sum >= 55 && $sum <= 59):
					echo "D+";
				break;
			case ($sum >= 50 && $sum <= 54):
					echo "D";
				break;
			case ($sum >= 0 && $sum <= 49):
					echo "F";
				break;		
			default:
				echo "ซ้ำชั้นไป";
		}
	}
	else{
		echo 'error';
	}
}

// โจทย์5
// จงหาค่าน้อยที่สุด และค่ามากที่สุด จากข้อมูลที่กำหนดให้ และแสดงผลออกทางจอภาพ 

// ข้อมูลนำเข้า
// บรรทัดแรก จำนวนเต็มบวก n (1 <= n <= 1,000) บ่งบอกถึงจำนวนข้อมูลที่โจทย์กำหนดให้ 
// บรรทัดที่ 2 ถึง n+1 จำนวนเต็ม Ai เป็นข้อมูลทั้งหมด ( -2,000,000,000 <= Ai <= 2,000,000,000) 

// ข้อมูลส่งออก
// บรรทัดแรก จำนวนเต็ม m แสดงจำนวนที่มีค่าน้อยที่สุดในชุดข้อมูลที่โจทย์กำหนด 
// บรรทัดที่สอง จำนวนเต็ม M แสดงจำนวนที่มีค่ามากที่สุดในชุดข้อมูลที่โจทย์กำหนด 
function _example5($a,$b,$c){
	$arr = array();
	
	if(($a >= 1 && $a <= 1000) && ($b >= 1 && $b <= 1000) && ($c >= 1 && $c <= 1000)){
		$arr[] = $a;
		$arr[] = $b;
		$arr[] = $c;
	}
	else{
		echo "error";
	}
	echo "min : ".min($arr). " " . "max: ".max($arr);
}

//โจทย์6
// บวกเมทตริก
function _example6(){
	$matrix[2][2] = 
}

?>

</HTML>